In [4]:
# Import stuff.
import pandas as pd
import matplotlib.pyplot as plt
import scipy.stats as sts
import numpy as np

In [5]:
# Create connection.
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:postgres@localhost:5433/SQL-Challenge')
conn = engine.connect()

In [8]:
# Test connection.
data = pd.read_sql("select * from employees", conn)
pd.DataFrame(data).head()

   emp_no emp_title_id  birth_date  first_name  last_name sex   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb   F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18

In [12]:
# Create a histogram to visualize the most common salary ranges for employees.

# Create a working table.
data = pd.read_sql("select e.first_name, e.last_name, e.sex, d.dept_name, t.title, s.salary \
    from employees as e \
    join salaries as s on e.emp_no = s.emp_no \
    join dept_emp as q on q.emp_no = e.emp_no \
    join departments as d on d.dept_no = q.dept_no \
    join titles as t on t.title_id = e.emp_title_id;", conn)
working_table = pd.DataFrame(data)

  first_name last_name sex           dept_name         title  salary
0    Kyoichi  Maliniak   M     Human Resources         Staff   78228
1  Duangkaew  Piveteau   F          Production      Engineer   72488
2  Duangkaew  Piveteau   F  Quality Management      Engineer   72488
3       Mary     Sluis   F    Customer Service         Staff   42365
4  Eberhardt    Terkki   M     Human Resources  Senior Staff   40000

In [ ]:
# Create a bar chart of average salary by title.